MMBytes/MultiGeiger-V2/sdkconfig.defaults.heltec_v2
# ============================================================================
# Heltec WiFi Kit 32 V2 overlay — ESP32-D0WDQ6, 8 MB flash, no PSRAM, CP2102.
# ============================================================================

CONFIG_IDF_TARGET="esp32"

# Auto-detect XTAL — Heltec V2 modules may be 26 MHz (arduino-esp32 default is AUTO).
# Hardcoding 40 MHz here produced garbled UART (~177 kbaud actual at 115200 nominal).
CONFIG_XTAL_FREQ_AUTO=y

# 8 MB flash on Heltec V2.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# V2.4.5 enabled CONFIG_MBEDTLS_DYNAMIC_BUFFER=y here for ~15-20 KB of
# transient heap headroom. V2.4.7 REVERTED it because it interacts badly
# with the hand-rolled mbedTLS session lifecycle in log_ftp.c — every FTPS
# upload triggered a TLSF heap-corruption assert in
# mbedtls_ssl_session_reset → mbedtls_ssl_session_reset_msg_layer → mbedtls_free,
# panicking the device. esp_tls / esp_http_client clients (HTTPS uploads,
# MQTT TLS) were unaffected because they don't expose mbedTLS internals.
# The 15-20 KB transient gain is not worth the regression in the
# load-bearing FTPS path. The V2.4.5 log-ring trim (60→45 KB) stays —
# that's an independent change and is fine.
#
# To re-enable in the future, the log_ftp.c io_close / session-reset
# path needs auditing to handle the dynamic-buffer free pattern (likely
# a missing buffer-pointer reset or a double-free trigger).
# CONFIG_MBEDTLS_DYNAMIC_BUFFER is not set
# CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA is not set
# CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT is not set
